adamgreen/nrf52-SmartWatch/firmware/main.cpp
// Analog to digital converter object used to read watch battery voltage.
static SAADCScanner         g_adc(NRF_SAADC_RESOLUTION_12BIT, false, _PRIO_APP_LOWEST);

// Battery voltage is read using this ADC channel.
SAADCScanner::Channel*      g_pBatteryVoltageChannel = NULL;

// LCD display.
static const nrf_drv_spi_t  g_lcdSpiInstance = NRF_DRV_SPI_INSTANCE(LCD_SPI_INSTANCE);
static nrf_drv_pwm_t        g_lcdPwmInstance = NRF_DRV_PWM_INSTANCE(LCD_PWM_INSTANCE);
ColorMemLCD                 g_lcd(&g_lcdSpiInstance, &g_lcdPwmInstance,
                                  LCD_SCLK_PIN, LCD_SI_PIN, LCD_SCS_PIN,
                                  LCD_EXTCOMIN_PIN, LCD_DISP_PIN, LCD_BACKLIGHT_PIN);

// Heart animation object.
static HeartAnimation       g_heartAnimation(0.2f, 0.5f, 0.05f);

// This counter is incremented each time a UI component is update and the screen should be updated.
static volatile uint32_t    g_uiUpdates = 1;

// Globals used to communicate state between Heart Rate Monitor (hrm) and main loop.
static volatile uint16_t    g_hrmConnectionHandle = BLE_CONN_HANDLE_INVALID;
static volatile bool        g_isHrmConnected = false;
static volatile uint32_t    g_heartRate = 0;
static CircularBuffer<uint16_t, 5, true> g_rrIntervals;

// Latest watch battery voltage.
static volatile float       g_watchBatteryVoltage = 0.0f;

// Latest heart rate monitor voltage level (%).
static volatile uint8_t     g_hrmBatteryLevel = 0;

// Global BLE modules.
static ble_db_discovery_t   g_bleDbDiscovery;
static ble_hrs_c_t          g_bleHeartRateClient;
static ble_bas_c_t          g_bleBatteryClient;
static ble_gap_scan_params_t g_bleScanParameters;
static nrf_ble_gatt_t       g_bleGatt;

// Globals to track state within application's BLE stack.
static bool                 g_isWhitelistDisabled;
static bool                 g_isFlashAccessInProgress;

// If first call to ble_db_discovery_start() fails when connection is first made, then retry it later.
static bool                 g_retryDbDiscovery;
static uint16_t             g_bleConnectionToRetryDbDiscovery = BLE_CONN_HANDLE_INVALID;

// App Timer Instances.
// Timer used to sample the watch battery on a regular basis.
APP_TIMER_DEF(g_batteryReadTimer);
// Timer used to debounce watch button presses.
APP_TIMER_DEF(g_buttonDebounceTimer);
// Timer used to animate things like the heart throb.
APP_TIMER_DEF(g_animationTimer);

// Connection timing parameters requested for BLE connection.
static const ble_gap_conn_params_t g_bleConnectionParameters =
{
    (uint16_t)MIN_CONNECTION_INTERVAL,
    (uint16_t)MAX_CONNECTION_INTERVAL,
    (uint16_t)SLAVE_LATENCY,
    (uint16_t)SUPERVISION_TIMEOUT
};

// When scanning for a peripheral to which a connection should be made, you can use one of 3 methods to find a match
// based on the data advertised by peripherals in the vicinity of this BLE central device:
// 1. The name of the Heart Rate Monitor to which a connection should be made.
//     Empty string if don't want to search by name.
static const char g_targetPeripheralName[] = "";
// 2. A specific device address.
//    Set g_useTargetPeripheralAddress to true if you want to use the address in g_targetPeripheralAddress.
static bool                 g_useTargetPeripheralAddress = false;
static const ble_gap_addr_t g_targetPeripheralAddress =
{
    // Possible values for addr_type:
    //   BLE_GAP_ADDR_TYPE_PUBLIC,
    //   BLE_GAP_ADDR_TYPE_RANDOM_STATIC,
    //   BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE,
    //   BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE.
    .addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC,
    .addr      = {0x8D, 0xFE, 0x23, 0x86, 0x77, 0xD9}
};
// 3. The UUID of the BLE Heart Rate Service.
#define TARGET_UUID         BLE_UUID_HEART_RATE_SERVICE





// UNDONE: Don't really want to go to sleep on Watch since I haven't made sure that I can wake it up yet.
#ifdef UNDONE
/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t errorCode = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(errorCode);

    // Prepare wakeup buttons.
    errorCode = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(errorCode);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    errorCode = sd_power_system_off();
    APP_ERROR_CHECK(errorCode);
}
#endif // UNDONE





// Forward Function Declarations
static void initLCD();
static void initTimers();
static void handleBatteryTimer(void* pvContext);
static void handleButtonDebounceTimer(void* pvContext);
static void handleAnimationTimer(void* pvContext);
static void initBleStack();
static void initBLE(void);
static void dispatchBleEvents(ble_evt_t* pBleEvent);
static void handleBleEvent(ble_evt_t* pBleEvent);
static bool findPeerAddressInAdvertisementData(const ble_gap_evt_adv_report_t* pAdvertisementReport,
                                               const ble_gap_addr_t* pAddressOut);
static bool findNameInAdvertisementData(const ble_gap_evt_adv_report_t* pAdvertisementReport, const char* pNameToFind);
static uint32_t parseAdvertisementData(uint8_t type, SizedData* pAdvertisementData, SizedData* pTypeData);
static bool findUuidInAdvertisementData(const ble_gap_evt_adv_report_t* pAdvertisementReport, const uint16_t uuidToFind);
static uint16_t extractUUID16(const uint8_t* pSrc);
static void dispatchSysEvents(uint32_t sysEvent);
static void handleSysEvents(uint32_t sysEvent);
static void initPeerManager(bool eraseBonds);
static void handlePeerManagerEvents(pm_evt_t const* pGattEvent);
static void initGATT();
static void handleGattEvent(nrf_ble_gatt_t* pGATT, nrf_ble_gatt_evt_t* pGattEvent);
static void initDbDiscoveryModule();
static void handleDbDiscoveryEvent(ble_db_discovery_evt_t* pGattEvent);
static void initHeartRateService();
static void handleHeartRateServiceEvent(ble_hrs_c_t* pHeartRate, ble_hrs_c_evt_t* pHeartRateEvent);
static void initBatteryService();
static void handleBatteryServiceEvent(ble_bas_c_t * pBatteryService, ble_bas_c_evt_t * pBatteryServiceEvent);
static void initBatteryVoltageReading();
static float readBatteryVoltage();
static void initButtonInterrupt();
static void handleButtonPress(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action);
static void stopBLE();
static void startBLE();
static void startTimers();
static void stopTimers();
static void startScanningForHeartRateMonitor();
static void loadWhitelist();
static void getPeerList(pm_peer_id_t* pPeers, uint32_t* peerCount);
static void sleepUntilNextEvent();
static void clearPendingFpuExceptions();
static void checkForErroneousPendingInterrupts();
static void updateLCD();


int main(void)
{
    logPrintF("Starting up...\n");

    initLCD();
    initTimers();
    initBleStack();
    initBatteryVoltageReading();
    initButtonInterrupt();
    startTimers();

    // Start scanning for peripherals and initiate connection with devices that advertise Heart Rate UUID.
    logPrintF("Heart Rate Example.\n");
    startScanningForHeartRateMonitor();

    // Main UI Loop.
    for (;;)
    {
        sleepUntilNextEvent();
        updateLCD();
    }
}

static void initLCD()
{
    g_lcd.init();
    g_lcd.turnOn();
    g_lcd.setTextSize(2);
    bool result = g_heartAnimation.init();
    ASSERT ( result );
}

static void initTimers()
{
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);

    // Create the timer used to read the watch battery voltage on a regular basis.
    ret_code_t errorCode = app_timer_create(&g_batteryReadTimer, APP_TIMER_MODE_REPEATED, handleBatteryTimer);
    APP_ERROR_CHECK(errorCode);

    // Create the timer used to debounce watch button presses by ignoring subsequent presses for some time before
    // re-enabling button press interrupts.
    errorCode = app_timer_create(&g_buttonDebounceTimer, APP_TIMER_MODE_SINGLE_SHOT, handleButtonDebounceTimer);
    APP_ERROR_CHECK(errorCode);

    // Create the timer used to display frames at the correct time.
    errorCode = app_timer_create(&g_animationTimer, APP_TIMER_MODE_SINGLE_SHOT, handleAnimationTimer);
    APP_ERROR_CHECK(errorCode);
}

static void handleBatteryTimer(void* pvContext)
{
    g_watchBatteryVoltage = readBatteryVoltage();
    nrf_atomic_u32_add(&g_uiUpdates, 1);
    logPrintF("Vbatt=%.1f\n", g_watchBatteryVoltage + 0.05f);
}

