adamgreen/nrf52-SmartWatch/firmware/main.cpp
static void handleButtonDebounceTimer(void* pvContext)
{
    // Re-enable the GPIOTE interrupt for button presses.
    nrf_drv_gpiote_in_event_enable(BUTTON_PIN, true);
}

static void handleAnimationTimer(void* pvContext)
{
    // Let main loop know that there is something on the display to be updated.
    nrf_atomic_u32_add(&g_uiUpdates, 1);
}
static void initBleStack()
{
    initBLE();

    // UNDONE: Need way do this on the watch itself.
    bool eraseBonds = false;
    initPeerManager(eraseBonds);
    if (eraseBonds == true)
    {
        logPrintF("Bonds erased!\n");
    }

    initGATT();
    initDbDiscoveryModule();
    initHeartRateService();
    initBatteryService();
}

static void initBLE()
{
    uint32_t errorCode;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t bleEnableParams;
    errorCode = softdevice_enable_get_default_config(NRF_BLE_CENTRAL_LINK_COUNT,
                                                     NRF_BLE_PERIPHERAL_LINK_COUNT,
                                                     &bleEnableParams);
    APP_ERROR_CHECK(errorCode);

    // Verify that the start of RAM in nr52.ld leaves enough room for the softdevice when configured for the desired
    // number of central and peripheral links.
    CHECK_RAM_START_ADDR(NRF_BLE_CENTRAL_LINK_COUNT, NRF_BLE_PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    bleEnableParams.gatt_enable_params.att_mtu = NRF_BLE_GATT_MAX_MTU_SIZE;
#endif

    errorCode = softdevice_enable(&bleEnableParams);
    APP_ERROR_CHECK(errorCode);

    // Register with the SoftDevice handler module for BLE events.
    errorCode = softdevice_ble_evt_handler_set(dispatchBleEvents);
    APP_ERROR_CHECK(errorCode);

    // Register with the SoftDevice handler module for System events.
    errorCode = softdevice_sys_evt_handler_set(dispatchSysEvents);
    APP_ERROR_CHECK(errorCode);

    // For now it is ok to have a longer latency out of sleep mode so enable low power sleep mode.
    sd_power_mode_set(NRF_POWER_MODE_LOWPWR);
    APP_ERROR_CHECK(errorCode);

    // Enable the DC to DC converter if possible as it reduced current consumption. Requires external components that
    // the Bangle.js2 has installed.
    if (WATCH_HAS_DCDC_PASSIVES)
    {
        errorCode = sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
        APP_ERROR_CHECK(errorCode);
    }
}

static void dispatchBleEvents(ble_evt_t* pBleEvent)
{
    // Call ble_conn_state_on_ble_evt() before other functions that depend on ble_conn_state, like Peer Manager.
    ble_conn_state_on_ble_evt(pBleEvent);
    pm_on_ble_evt(pBleEvent);
    ble_db_discovery_on_ble_evt(&g_bleDbDiscovery, pBleEvent);
    ble_hrs_c_on_ble_evt(&g_bleHeartRateClient, pBleEvent);
    ble_bas_c_on_ble_evt(&g_bleBatteryClient, pBleEvent);
    nrf_ble_gatt_on_ble_evt(&g_bleGatt, pBleEvent);
    handleBleEvent(pBleEvent);
}

static void handleBleEvent(ble_evt_t* pBleEvent)
{
    uint32_t                errorCode;
    const ble_gap_evt_t   * pBleGapEvent = &pBleEvent->evt.gap_evt;

    switch (pBleEvent->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
        {
            logPrintF("Connected.\n");
            g_hrmConnectionHandle = pBleEvent->evt.gap_evt.conn_handle;

            // Discover services supported by this peripheral.
            g_bleConnectionToRetryDbDiscovery = pBleEvent->evt.gap_evt.conn_handle;
            g_retryDbDiscovery = false;
            errorCode = ble_db_discovery_start(&g_bleDbDiscovery, g_bleConnectionToRetryDbDiscovery);
            if (errorCode == NRF_ERROR_BUSY)
            {
                logPrintF("ble_db_discovery_start() returned busy, will retry later.\n");
                g_retryDbDiscovery = true;
            }
            else
            {
                APP_ERROR_CHECK(errorCode);
            }

#ifdef UNDONE
            errorCode = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(errorCode);
#endif // UNDONE

            // If can still connect to more peripherals, then continue scanning for them.
            if (ble_conn_state_n_centrals() < NRF_BLE_CENTRAL_LINK_COUNT)
            {
                startScanningForHeartRateMonitor();
            }
        } break;

        case BLE_GAP_EVT_ADV_REPORT:
        {
            // UNDONE: The adv_report also has RSSI that can be used.
            //         Hopefully we can store the peer_addr along with RSSI, name, etc to display to user and
            //         call sd_ble_gap_connect() later.
            // Look at the advertised data from this peripheral to see if it one of the devices that we want to connect
            // to based on name, address, or supported UUIDs.
            bool isSupportedPeripheral = false;
            if (g_useTargetPeripheralAddress)
            {
                if (findPeerAddressInAdvertisementData(&pBleGapEvent->params.adv_report, &g_targetPeripheralAddress))
                {
                    logPrintF("Address match. Send connect request.\n");
                    isSupportedPeripheral = true;
                }
            }
            else if (strlen(g_targetPeripheralName) != 0)
            {
                if (findNameInAdvertisementData(&pBleGapEvent->params.adv_report, g_targetPeripheralName))
                {
                    isSupportedPeripheral = true;
                    logPrintF("Name match. Send connect request.\n");
                }
            }
            else
            {
                if (findUuidInAdvertisementData(&pBleGapEvent->params.adv_report, TARGET_UUID))
                {
                    isSupportedPeripheral = true;
                    logPrintF("UUID match. Send connect request.\n");
                }
            }

            // If we found a supported peripheral then try to connect to it.
            if (isSupportedPeripheral)
            {
                // Stop scanning.
                (void) sd_ble_gap_scan_stop();

