adamgreen/nrf52-SmartWatch/firmware/main.cpp
    errorCode = parseAdvertisementData(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE,
                                &advertisementData,
                                &typeData);

    if (errorCode != NRF_SUCCESS)
    {
        // Look for the services in 'complete' if it was not found in 'more available'.
        errorCode = parseAdvertisementData(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE,
                                     &advertisementData,
                                     &typeData);

        if (errorCode != NRF_SUCCESS)
        {
            // If we can't parse the data, then exit.
            return false;
        }
    }

    // Verify if any UUID match the given UUID.
    for (uint32_t i = 0; i < (typeData.dataLength / sizeof(uint16_t)); i++)
    {
        uint16_t extractedUUID = extractUUID16(&typeData.pData[i * sizeof(uint16_t)]);
        if (extractedUUID == uuidToFind)
        {
            return true;
        }
    }
    return false;
}

static uint16_t extractUUID16(const uint8_t* pSrc)
{
    return (pSrc[1] << 8) | pSrc[0];
}

static void dispatchSysEvents(uint32_t sysEvent)
{
    fs_sys_event_handler(sysEvent);
    handleSysEvents(sysEvent);
}

static void handleSysEvents(uint32_t sysEvent)
{
    switch (sysEvent)
    {
        case NRF_EVT_FLASH_OPERATION_SUCCESS:
            /* fall through */
        case NRF_EVT_FLASH_OPERATION_ERROR:

            if (g_isFlashAccessInProgress)
            {
                g_isFlashAccessInProgress = false;
                startScanningForHeartRateMonitor();
            }
            break;

        default:
            // No implementation needed.
            break;
    }
}

static void initPeerManager(bool eraseBonds)
{
    ble_gap_sec_params_t secParams;
    ret_code_t errorCode;

    errorCode = pm_init();
    APP_ERROR_CHECK(errorCode);

    if (eraseBonds)
    {
        errorCode = pm_peers_delete();
        APP_ERROR_CHECK(errorCode);
    }

    // Security parameters to be used for all security procedures.
    memset(&secParams, 0, sizeof(ble_gap_sec_params_t));
    secParams.bond              = SEC_PARAM_BOND;
    secParams.mitm              = SEC_PARAM_MITM;
    secParams.lesc              = SEC_PARAM_LESC;
    secParams.keypress          = SEC_PARAM_KEYPRESS;
    secParams.io_caps           = SEC_PARAM_IO_CAPABILITIES;
    secParams.oob               = SEC_PARAM_OOB;
    secParams.min_key_size      = SEC_PARAM_MIN_KEY_SIZE;
    secParams.max_key_size      = SEC_PARAM_MAX_KEY_SIZE;
    secParams.kdist_own.enc     = 1;
    secParams.kdist_own.id      = 1;
    secParams.kdist_peer.enc    = 1;
    secParams.kdist_peer.id     = 1;

    errorCode = pm_sec_params_set(&secParams);
    APP_ERROR_CHECK(errorCode);

    errorCode = pm_register(handlePeerManagerEvents);
    APP_ERROR_CHECK(errorCode);
}

static void handlePeerManagerEvents(pm_evt_t const* pGattEvent)
{
    ret_code_t errorCode;

    switch (pGattEvent->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            logPrintF("Connected to a previously bonded device.\n");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            logPrintF("Connection secured. Role: %d. conn_handle: %d, Procedure: %d\n",
                         ble_conn_state_role(pGattEvent->conn_handle),
                         pGattEvent->conn_handle,
                         pGattEvent->params.conn_sec_succeeded.procedure);
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
            /* Often, when securing fails, it shouldn't be restarted, for security reasons.
             * Other times, it can be restarted directly.
             * Sometimes it can be restarted, but only after changing some Security Parameters.
             * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
             * Sometimes it is impossible, to secure the link, or the peer device does not support it.
             * How to handle this error is highly application dependent. */
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(pGattEvent->conn_handle, &conn_sec_config);
        } break;

        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            errorCode = fds_gc();
            if (errorCode == FDS_ERR_BUSY || errorCode == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                APP_ERROR_CHECK(errorCode);
            }
        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {
            startScanningForHeartRateMonitor();
        } break;

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        {
            // The local database has likely changed, send service changed indications.
            pm_local_database_has_changed();
        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(pGattEvent->params.peer_data_update_failed.error);
        } break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(pGattEvent->params.peer_delete_failed.error);
        } break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(pGattEvent->params.peers_delete_failed_evt.error);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            APP_ERROR_CHECK(pGattEvent->params.error_unexpected.error);
        } break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }
}

static void initGATT()
{
    ret_code_t errorCode = nrf_ble_gatt_init(&g_bleGatt, handleGattEvent);
    APP_ERROR_CHECK(errorCode);
}

