adamgreen/nrf52-SmartWatch/firmware/main.cpp
static void handleGattEvent(nrf_ble_gatt_t* pGATT, nrf_ble_gatt_evt_t* pGattEvent)
{
    logPrintF("GATT MTU on link %d changed to %d\n",
                 pGattEvent->conn_handle,
                 pGattEvent->att_mtu_effective);
    if (g_retryDbDiscovery)
    {
        logPrintF("Retrying DB discovery.\n");

        // Discover peer's services.
        g_retryDbDiscovery = false;
        ret_code_t errorCode = ble_db_discovery_start(&g_bleDbDiscovery, g_bleConnectionToRetryDbDiscovery);
        if (errorCode == NRF_ERROR_BUSY)
        {
            logPrintF("ble_db_discovery_start() returned busy, will retry later.\n");
            g_retryDbDiscovery = true;
        }
        else
        {
            APP_ERROR_CHECK(errorCode);
        }
    }
}

static void initDbDiscoveryModule()
{
    uint32_t errorCode = ble_db_discovery_init(handleDbDiscoveryEvent);
    APP_ERROR_CHECK(errorCode);
}

static void handleDbDiscoveryEvent(ble_db_discovery_evt_t* pGattEvent)
{
    ble_hrs_on_db_disc_evt(&g_bleHeartRateClient, pGattEvent);
    ble_bas_on_db_disc_evt(&g_bleBatteryClient, pGattEvent);
}

static void initHeartRateService()
{
    ble_hrs_c_init_t hrsInitObject = { .evt_handler = handleHeartRateServiceEvent };

    uint32_t errorCode = ble_hrs_c_init(&g_bleHeartRateClient, &hrsInitObject);
    APP_ERROR_CHECK(errorCode);
}

static void handleHeartRateServiceEvent(ble_hrs_c_t* pHeartRate, ble_hrs_c_evt_t* pHeartRateEvent)
{
    uint32_t errorCode;

    switch (pHeartRateEvent->evt_type)
    {
        case BLE_HRS_C_EVT_DISCOVERY_COMPLETE:
            errorCode = ble_hrs_c_handles_assign(pHeartRate ,
                                                pHeartRateEvent->conn_handle,
                                                &pHeartRateEvent->params.peer_db);
            APP_ERROR_CHECK(errorCode);

            // Initiate bonding.
            errorCode = pm_conn_secure(pHeartRateEvent->conn_handle, false);
            if (errorCode != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(errorCode);
            }

            // Heart rate service discovered. Enable notification of Heart Rate Measurement.
            errorCode = ble_hrs_c_hrm_notif_enable(pHeartRate);
            APP_ERROR_CHECK(errorCode);

            logPrintF("Heart rate service discovered.\n");
            break;

        case BLE_HRS_C_EVT_HRM_NOTIFICATION:
        {
            // Save away this most recent heart rate measurement.
            g_isHrmConnected = true;
            g_heartRate = pHeartRateEvent->params.hrm.hr_value;
            nrf_atomic_u32_add(&g_uiUpdates, 1);
            logPrintF("Heart Rate = %d.\n", pHeartRateEvent->params.hrm.hr_value);
            for (int i = 0; i < pHeartRateEvent->params.hrm.rr_intervals_cnt; i++)
            {
                uint16_t currInterval = pHeartRateEvent->params.hrm.rr_intervals[i];
                logPrintF("rr_interval = %d.\n", currInterval);

                // Ignore any readings that are so different from current BPM that they cause weird animation hiccups.
                int32_t bpmFromInterval = 60000 / (int32_t)currInterval;
                if (g_heartRate > 0 && abs((int32_t)g_heartRate - bpmFromInterval) < 20)
                {
                    g_rrIntervals.write(pHeartRateEvent->params.hrm.rr_intervals[i]);
                }
            }
            break;
        }

        default:
            break;
    }
}

static void initBatteryService()
{
    ble_bas_c_init_t basInitObject = { .evt_handler = handleBatteryServiceEvent };

    uint32_t errorCode = ble_bas_c_init(&g_bleBatteryClient, &basInitObject);
    APP_ERROR_CHECK(errorCode);
}

static void handleBatteryServiceEvent(ble_bas_c_t* pBatteryService, ble_bas_c_evt_t* pBatteryServiceEvent)
{
    uint32_t errorCode;

    switch (pBatteryServiceEvent->evt_type)
    {
        case BLE_BAS_C_EVT_DISCOVERY_COMPLETE:
        {
            errorCode = ble_bas_c_handles_assign(pBatteryService,
                                                pBatteryServiceEvent->conn_handle,
                                                &pBatteryServiceEvent->params.bas_db);
            APP_ERROR_CHECK(errorCode);

            // Initiate bonding.
            errorCode = pm_conn_secure(pBatteryServiceEvent->conn_handle, false);
            if (errorCode != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(errorCode);
            }

            // Batttery service discovered. Enable notification of Battery Level.
            logPrintF("Battery Service discovered. Reading battery level.\n");

            errorCode = ble_bas_c_bl_read(pBatteryService);
            APP_ERROR_CHECK(errorCode);

            logPrintF("Enabling Battery Level Notification.\n");
            errorCode = ble_bas_c_bl_notif_enable(pBatteryService);
            APP_ERROR_CHECK(errorCode);

        } break;

        case BLE_BAS_C_EVT_BATT_NOTIFICATION:
            logPrintF("Battery Level received %d %%.\n", pBatteryServiceEvent->params.battery_level);
            g_hrmBatteryLevel = pBatteryServiceEvent->params.battery_level;
            nrf_atomic_u32_add(&g_uiUpdates, 1);
            break;

        case BLE_BAS_C_EVT_BATT_READ_RESP:
            logPrintF("Battery Level Read as %d %%.\n", pBatteryServiceEvent->params.battery_level);
            g_hrmBatteryLevel = pBatteryServiceEvent->params.battery_level;
            nrf_atomic_u32_add(&g_uiUpdates, 1);
            break;

        default:
            break;
    }
}

static void initBatteryVoltageReading()
{
    // Initialize the ADC object which scans all of the configured ADC channels manually.
    bool result = g_adc.init();
    ASSERT ( result );
    g_pBatteryVoltageChannel = g_adc.addChannel(BATTERY_VOLTAGE_PIN,
                                                NRF_SAADC_RESISTOR_DISABLED,
                                                NRF_SAADC_GAIN1_4,
                                                NRF_SAADC_REFERENCE_VDD4,
                                                NRF_SAADC_ACQTIME_3US,
                                                SAADC_LOWER_LIMIT_DISABLED,
                                                SAADC_UPPER_LIMIT_DISABLED,
                                                NULL);
    ASSERT ( g_pBatteryVoltageChannel != NULL );
    g_adc.startScanning();
}

