adamgreen/nrf52-SmartWatch/firmware/main.cpp
static float readBatteryVoltage()
{
    // Read the battery voltage.
    ASSERT ( g_pBatteryVoltageChannel->getSampleCount() > 0 );
    SAADCScanner::Channel::Reading reading = g_pBatteryVoltageChannel->read();
    float batteryVoltage = 3.3f * 4.0f * reading.mean / 4095.0f;

    // Kick off the next ADC sampling cycle so that the sample is ready by the time it is needed.
    g_adc.startScanning();

    return batteryVoltage;
}

static void initButtonInterrupt()
{
    // Configure button on right side of watch to generate interrupt when it is pressed.
    nrf_drv_gpiote_in_config_t gpioteConfig =
    {
        .sense = NRF_GPIOTE_POLARITY_HITOLO,
        .pull = NRF_GPIO_PIN_PULLUP,
        .is_watcher = false,
        .hi_accuracy = false
    };
    uint32_t errorCode = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(errorCode);

    errorCode = nrf_drv_gpiote_in_init(BUTTON_PIN, &gpioteConfig, handleButtonPress);
    APP_ERROR_CHECK(errorCode);

    nrf_drv_gpiote_in_event_enable(BUTTON_PIN, true);
}

static void handleButtonPress(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    // Disable the button sensing and re-enable it from a timer later.
    nrf_drv_gpiote_in_event_disable(BUTTON_PIN);
    ret_code_t errorCode = app_timer_start(g_buttonDebounceTimer, BUTTON_DEBOUNCE_TICKS, NULL);
    APP_ERROR_CHECK(errorCode);

    if (g_lcd.isOn())
    {
        g_lcd.turnOff();
        stopTimers();
        stopBLE();
    }
    else
    {
        g_lcd.turnOn();
        nrf_atomic_u32_add(&g_uiUpdates, 1);
        startBLE();
        startTimers();
    }
}

static void stopBLE()
{
    // User has asked for Watch to be turned off so stop BLE activity (connection or scanning).
    if (g_hrmConnectionHandle != BLE_CONN_HANDLE_INVALID)
    {
        // Are currently connected to the heart rate monitor so disconnect from it.
        // Normally the disconnect message would later cause the next scan to start but this has been disabled if
        // the LCD is turned off.
        (void) sd_ble_gap_disconnect(g_hrmConnectionHandle,  BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    }
    else
    {
        // Hadn't found heart rate monitor yet so just stop scanning for it.
        (void) sd_ble_gap_scan_stop();
    }
}

static void startBLE()
{
    // User has asked for Watch to be turned back on.
    startScanningForHeartRateMonitor();
}

static void startTimers()
{
    // Perform initial watch battery voltage read now and then start timer to perform it in the future.
    handleBatteryTimer(NULL);
    ret_code_t errorCode = app_timer_start(g_batteryReadTimer, BATTERY_READ_TICKS, NULL);
    APP_ERROR_CHECK(errorCode);
}

static void stopTimers()
{
    ret_code_t errorCode = app_timer_stop(g_batteryReadTimer);
    APP_ERROR_CHECK(errorCode);
}

static void startScanningForHeartRateMonitor()
{
    // If there are any pending writes to FLASH, defer scanning until it completes.
    uint32_t isFlashBusy;
    (void) fs_queued_op_count_get(&isFlashBusy);
    if (isFlashBusy != 0)
    {
        g_isFlashAccessInProgress = true;
        return;
    }

    // Whitelist buffers.
    ble_gap_addr_t whitelistAddresses[8];
    ble_gap_irk_t  whitelistIRKs[8];
    memset(whitelistAddresses, 0x00, sizeof(whitelistAddresses));
    memset(whitelistIRKs,  0x00, sizeof(whitelistIRKs));

    uint32_t addressCount = (sizeof(whitelistAddresses) / sizeof(ble_gap_addr_t));
    uint32_t irkCount  = (sizeof(whitelistIRKs)  / sizeof(ble_gap_irk_t));

    #if (NRF_SD_BLE_API_VERSION == 2)

        ble_gap_addr_t* p_whitelist_addrs[8];
        ble_gap_irk_t*  p_whitelist_irks[8];

        for (uint32_t i = 0; i < 8; i++)
        {
            p_whitelist_addrs[i] = &whitelistAddresses[i];
            p_whitelist_irks[i]  = &whitelistIRKs[i];
        }

        ble_gap_whitelist_t whitelist =
        {
            .pp_addrs = p_whitelist_addrs,
            .pp_irks  = p_whitelist_irks,
        };

    #endif

    // Reload the whitelist and whitelist all peers.
    loadWhitelist();

    // Get the whitelist previously set using pm_whitelist_set().
    ret_code_t errorCode = pm_whitelist_get(whitelistAddresses, &addressCount,
                                            whitelistIRKs,  &irkCount);

    g_bleScanParameters.active   = 0;
    g_bleScanParameters.interval = SCAN_INTERVAL;
    g_bleScanParameters.window   = SCAN_WINDOW;

    if (((addressCount == 0) && (irkCount == 0)) ||
        (g_isWhitelistDisabled))
    {
        // Don't use whitelist.
        #if (NRF_SD_BLE_API_VERSION == 2)
            g_bleScanParameters.selective   = 0;
            g_bleScanParameters.p_whitelist = NULL;
        #endif
        #if (NRF_SD_BLE_API_VERSION == 3)
            g_bleScanParameters.use_whitelist  = 0;
            g_bleScanParameters.adv_dir_report = 0;
        #endif
        g_bleScanParameters.timeout  = 0x0000; // No timeout.
    }
    else
    {
        // Use whitelist.
        #if (NRF_SD_BLE_API_VERSION == 2)
            whitelist.addr_count     = addressCount;
            whitelist.irk_count      = irkCount;
            g_bleScanParameters.selective   = 1;
            g_bleScanParameters.p_whitelist = &whitelist;
        #endif
        #if (NRF_SD_BLE_API_VERSION == 3)
            g_bleScanParameters.use_whitelist  = 1;
            g_bleScanParameters.adv_dir_report = 0;
        #endif
        g_bleScanParameters.timeout  = 0x001E; // 30 seconds.
    }

    logPrintF("Starting scan.\n");

    errorCode = sd_ble_gap_scan_start(&g_bleScanParameters);
    APP_ERROR_CHECK(errorCode);

#ifdef UNDONE
    errorCode = bsp_indication_set(BSP_INDICATE_SCANNING);
    APP_ERROR_CHECK(errorCode);
#endif // UNDONE
}

static void loadWhitelist()
{
    pm_peer_id_t peers[8];
    memset(peers, PM_PEER_ID_INVALID, sizeof(peers));
    uint32_t peerCount = (sizeof(peers) / sizeof(pm_peer_id_t));

    // Load all peers from flash and whitelist them.
    getPeerList(peers, &peerCount);

    ret_code_t errorCode = pm_whitelist_set(peers, peerCount);
    APP_ERROR_CHECK(errorCode);

    // Setup the device identities list.
    // Some SoftDevices do not support this feature.
    errorCode = pm_device_identities_list_set(peers, peerCount);
    if (errorCode != NRF_ERROR_NOT_SUPPORTED)
    {
        APP_ERROR_CHECK(errorCode);
    }
}

static void getPeerList(pm_peer_id_t* pPeers, uint32_t* peerCount)
{
    uint32_t peersToCopy = (*peerCount < BLE_GAP_WHITELIST_ADDR_MAX_COUNT) ? *peerCount : BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

    *peerCount = 0;
    pm_peer_id_t peerID = pm_next_peer_id_get(PM_PEER_ID_INVALID);
    while ((peerID != PM_PEER_ID_INVALID) && (peersToCopy--))
    {
        pPeers[(*peerCount)++] = peerID;
        peerID = pm_next_peer_id_get(peerID);
    }
}

static void sleepUntilNextEvent()
{
    clearPendingFpuExceptions();

