adamgreen/nrf52-SmartWatch/firmware/main.cpp
    uint32_t errorCode = sd_app_evt_wait();
    APP_ERROR_CHECK(errorCode);

    checkForErroneousPendingInterrupts();
}

static void clearPendingFpuExceptions()
{
    uint32_t fpscr = __get_FPSCR();
    __set_FPSCR(fpscr & ~0x9Fu);
    __DMB();
    NVIC_ClearPendingIRQ(FPU_IRQn);

    // Assert if a critical FPU exception is signaled.
    ASSERT((fpscr & 0x03) == 0);
}

static void checkForErroneousPendingInterrupts()
{
    // Are there random interrupts pending that are masked off but sd_app_evt_wait() thinks are important to app so
    // won't put device to sleep properly.
    const uint32_t interruptsUsedBySoftDevice = 0x4300f903;
    uint32_t ISPR0 = NVIC->ISPR[0] & ~interruptsUsedBySoftDevice;
    uint32_t ISPR1 = NVIC->ISPR[1] & ~(1 << (FPU_IRQn-32));
    if (ISPR0 || ISPR1)
    {
        __debugbreak();
    }
}

static void updateLCD()
{
    static uint32_t lastUiUpdate = 0;

    // Only want to send updates to LCD if something has changed and the LCD is on.
    uint32_t currUiUpdate = g_uiUpdates;
    if (!g_lcd.isOn() || currUiUpdate == lastUiUpdate)
    {
        return;
    }
    lastUiUpdate = currUiUpdate;

    // Prepare the LCD frame buffer for updating.
    g_lcd.waitForRefreshToComplete();
    g_lcd.fillScreen(ColorMemLCD::COLOR_WHITE);

    // General measurements of where things should be placed on the display.
    const uint32_t topMargin = 2;
    const uint32_t chargingBitmapWidth = 20;
    const uint32_t batteryIconXOffset = ColorMemLCD::DISP_WIDTH - g_batteryBitmapWidth - chargingBitmapWidth;
    const uint32_t bpmTopMargin = 5;
    const uint32_t throbbingHeartXCenter = 23;
    const uint32_t hrmBatteryRightMargin = 6;

    // UNDONE: Make these global constants at top of code.
    // Consider 4.2V full and 3.6V empty.
    const float maxVoltage = 4.2f;
    const float minVoltage = 3.6f;
    const float lowVoltage = 3.8f;
    const uint8_t lowHrmBatteryPercent = 20;

    // Calculate the battery capacity left based on voltage range. Cap it at 0%.
    float batteryVoltage = g_watchBatteryVoltage;
    float batteryPercent = (batteryVoltage - minVoltage) / (maxVoltage - minVoltage);
    if (batteryPercent < 0.0f)
    {
        batteryPercent = 0.0f;
    }
#ifdef UNDONE
    // UNDONE:
    logPrintF("batteryVoltage=%.2f\n", batteryVoltage);
    logPrintF("batteryPercent=%.2f\n", batteryPercent);
#endif // UNDONE

    // Set icon color based on how much battery is left: black for normal and red for low.
    uint16_t voltageColor = ColorMemLCD::COLOR_BLACK;
    if (batteryVoltage <= lowVoltage)
    {
        voltageColor = ColorMemLCD::COLOR_RED;
    }

    // Draw battery icon in required color.
    g_lcd.drawBitmap(batteryIconXOffset, topMargin - 1,
                     g_batteryBitmap, g_batteryBitmapWidth, g_batteryBitmapHeight, voltageColor);

    // Fill the inside of the battery icon with black and then place a rounded rect of white in the left portion of
    // the battery icon to indicate how much battery capacity is left.
    uint32_t rectWidth = batteryPercent * (g_batteryIconRectWidth - 8);
    g_lcd.fillRoundRect(batteryIconXOffset + 2, topMargin + 1,
                        g_batteryIconRectWidth - 4, g_batteryBitmapHeight - 4,
                        g_batteryIconRadius, ColorMemLCD::COLOR_BLACK);
    g_lcd.fillRoundRect(batteryIconXOffset + 4, topMargin + 3,
                        rectWidth, g_batteryBitmapHeight - 8,
                        g_batteryIconRadius, ColorMemLCD::COLOR_WHITE);


    // Output watch battery voltage on top of the battery icon.
    // Draw the 2 voltage characters separately and insert a narrow '.' between them to simulate proportional font.
    // Use XOR for drawing the voltage on top of the battery icon so that it will be black text on white fill or
    // white text on black fill. Use a canvas to draw the 'proportional' font so that it can be smoothed without
    // effecting the XOR operation since smoothing can touch some pixels multiple times.
    char buffer[3];
    snprintf(buffer, sizeof(buffer), "%2.0f", batteryVoltage * 10.0f);

    static GFXcanvas1 voltageCanvas(12+4+12, 16);
    voltageCanvas.fillScreen(0);
    voltageCanvas.drawChar(0, 0, buffer[0], 1, 1, 2);
    voltageCanvas.drawChar(7, 0, '.', 1, 1, 2);
    voltageCanvas.drawChar(12 + 4, 0, buffer[1], 1, 1, 2);

    g_lcd.enableXOR();
    g_lcd.drawBitmap(batteryIconXOffset + 8, topMargin+4,
                     voltageCanvas.getBuffer(), voltageCanvas.width(), voltageCanvas.height(), ColorMemLCD::COLOR_WHITE);
    g_lcd.disableXOR();

    // UNDONE: Add a charging icon if the USB power supply is connected and charging the battery.

    // Output BLE connection state or latest heart rate measurement.
    if (g_isHrmConnected)
    {
        const uint32_t charScale = 5;
        const uint32_t charWidth = charScale * 6;
        const uint32_t charHeight = charScale * 8;

        // Display the latest heart rate measurement.
        char buffer[4];
        int length = snprintf(buffer, sizeof(buffer), "%lu", g_heartRate);

        g_lcd.setTextSize(charScale);
        g_lcd.setTextColor(ColorMemLCD::COLOR_BLACK);
        g_lcd.setCursor(ColorMemLCD::DISP_WIDTH/2 - length * charWidth / 2,
                        topMargin + g_batteryBitmapHeight + bpmTopMargin);
        g_lcd.printf("%s", buffer);

        // Cap the battery percent at 100%.
        if (g_hrmBatteryLevel > 100)
        {
            g_hrmBatteryLevel = 100;
        }

        // Set fill color based on how much battery is left: green for normal and red for low.
        uint16_t voltageColor = ColorMemLCD::COLOR_GREEN;
        if (g_hrmBatteryLevel <= lowHrmBatteryPercent)
        {
            voltageColor = ColorMemLCD::COLOR_RED;
        }

        // Draw small battery icon in required color.
        g_lcd.drawBitmap(ColorMemLCD::DISP_WIDTH - g_batterySmallBitmapWidth - hrmBatteryRightMargin,
                         topMargin + g_batteryBitmapHeight + bpmTopMargin + charHeight/2 - g_batterySmallBitmapHeight/2 - 2,
                         g_batterySmallBitmap, g_batterySmallBitmapWidth, g_batterySmallBitmapHeight,
                         ColorMemLCD::COLOR_BLACK);

