adamgreen/nrf52-SmartWatch/firmware/main.cpp
        // Fill the inside of the battery icon with black and then place a rounded rect of white in the left portion of
        // the battery icon to indicate how much battery capacity is left.
        uint32_t rectWidth = g_hrmBatteryLevel * (g_batterySmallIconRectWidth - 8) / 100;
        g_lcd.fillRoundRect(ColorMemLCD::DISP_WIDTH - g_batterySmallBitmapWidth - hrmBatteryRightMargin + 2,
                           topMargin + g_batteryBitmapHeight + bpmTopMargin + charHeight/2 - g_batterySmallBitmapHeight/2 - 2 + 2,
                           g_batterySmallIconRectWidth - 4, g_batterySmallBitmapHeight - 4,
                            g_batterySmallIconRadius, ColorMemLCD::COLOR_BLACK);
        g_lcd.fillRoundRect(ColorMemLCD::DISP_WIDTH - g_batterySmallBitmapWidth - hrmBatteryRightMargin + 4,
                            topMargin + g_batteryBitmapHeight + bpmTopMargin + charHeight/2 - g_batterySmallBitmapHeight/2 - 2 + 4,
                            rectWidth, g_batterySmallBitmapHeight - 8,
                            g_batterySmallIconRadius, voltageColor);

        if (g_heartRate > 0)
        {
            static uint16_t lastValidRRInterval = 1000/60;
            int32_t frameTime_ms = g_heartAnimation.drawAnimationFrame(g_lcd);
            if (frameTime_ms == 0)
            {
                uint16_t currRRInterval;
                if (!g_rrIntervals.read(currRRInterval))
                {
                    currRRInterval = lastValidRRInterval;
                }
                else
                {
                    lastValidRRInterval = currRRInterval;
                }
                frameTime_ms = g_heartAnimation.startAnimation(g_lcd, throbbingHeartXCenter,
                                                               topMargin + g_batteryBitmapHeight + bpmTopMargin + charHeight/2 - 2,
                                                                ColorMemLCD::COLOR_RED, currRRInterval);
            }
            ASSERT (frameTime_ms >= 0 && frameTime_ms < 1000 );
            if (frameTime_ms < 1)
            {
                frameTime_ms = 1;
            }
            ret_code_t errorCode = app_timer_start(g_animationTimer, APP_TIMER_TICKS(frameTime_ms, APP_TIMER_PRESCALER), NULL);
            APP_ERROR_CHECK(errorCode);
        }

    }
    else
    {
        // Draw a heart with BLE icon in the center if not connected.
        g_lcd.drawBitmap(ColorMemLCD::DISP_WIDTH/2 - g_heartBitmapWidth/2,
                        ColorMemLCD::DISP_HEIGHT/2 - g_heartBitmapHeight/2,
                        g_heartBitmap, g_heartBitmapWidth, g_heartBitmapHeight, ColorMemLCD::COLOR_RED);
        g_lcd.drawBitmap(ColorMemLCD::DISP_WIDTH/2 - g_bluetoothLargeBitmapWidth/2,
                        ColorMemLCD::DISP_HEIGHT/2 - g_bluetoothLargeBitmapHeight/2,
                        g_bluetoothLargeBitmap, g_bluetoothLargeBitmapWidth, g_bluetoothLargeBitmapHeight,
                        ColorMemLCD::COLOR_BLUE);
    }

    g_lcd.refresh();
}



// Break into debugger if any errors/asserts are detected at runtime.
// This handler is called when an application error is encountered in BLE stack or application code.
extern "C" void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
    __debugbreak();
}

extern "C" void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    __debugbreak();
}


// Required to get C++ code to build.
extern "C" void __cxa_pure_virtual()
{
    ASSERT ( 0 );
    abort();
}
